
const CITY = {
  北京: ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "海淀区", "丰台区", "石景山区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "门头沟区", "密云县", "延庆县"],
  天津: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "宝坻区", "滨海新区", "静海县", "宁河县", "蓟县"],
  上海: ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明县"],
  重庆: ["渝中区", "大渡口区", "江北区", "南岸区", "北碚区", "渝北区", "巴南区", "长寿区", "双桥区", "沙坪坝区", "万盛区", "万州区", "涪陵区", "黔江区", "永川区", "合川区", "江津区", "九龙坡区", "南川区", "綦江县", "潼南县", "荣昌县", "璧山县", "大足县", "铜梁县", "梁平县", "开县", "忠县", "城口县", "垫江县", "武隆县", "丰都县", "奉节县", "云阳县", "巫溪县", "巫山县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"],
  河北: ["石家庄", "唐山", "秦皇岛", "邯郸", "邢台", "保定", "张家口", "承德", "沧州", "廊坊", "衡水"],
  山西: ["太原", "大同", "阳泉", "长治", "晋城", "朔州", "晋中", "运城", "忻州", "临汾", "吕梁"],
  辽宁: ["沈阳", "大连", "鞍山", "抚顺", "本溪", "丹东", "锦州", "营口", "阜新", "辽阳", "盘锦", "铁岭", "朝阳", "葫芦岛"],
  吉林: ["长春", "吉林", "四平", "辽源", "通化", "白山", "松原", "白城", "延边朝鲜族自治州"],
  黑龙江: ["哈尔滨", "齐齐哈尔", "鹤岗", "双鸭山", "鸡西", "大庆", "伊春", "牡丹江", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭"],
  江苏: ["南京", "苏州", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "连云港", "徐州", "淮安", "宿迁"],
  浙江: ["杭州", "宁波", "温州", "嘉兴", "湖州", "绍兴", "金华", "衢州", "舟山", "台州", "丽水"],
  安徽: ["合肥", "芜湖", "蚌埠", "淮南", "马鞍山", "淮北", "铜陵", "安庆", "黄山", "滁州", "阜阳", "宿州", "巢湖", "六安", "亳州", "池州", "宣城"],
  福建: ["福州", "厦门", "莆田", "三明", "泉州", "漳州", "南平", "龙岩", "宁德"],
  江西: ["南昌", "景德镇", "萍乡", "九江", "新余", "鹰潭", "赣州", "吉安", "宜春", "抚州", "上饶"],
  山东: ["济南", "青岛", "淄博", "枣庄", "东营", "烟台", "潍坊", "济宁", "泰安", "威海", "日照", "莱芜", "临沂", "德州", "聊城", "滨州", "菏泽"],
  河南: ["郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店"],
  湖北: ["武汉", "黄石", "十堰", "荆州", "宜昌", "襄樊", "鄂州", "荆门", "孝感", "黄冈", "咸宁", "随州", "恩施"],
  湖南: ["长沙", "株洲", "湘潭", "衡阳", "邵阳", "岳阳", "常德", "张家界", "益阳", "郴州", "永州", "怀化", "娄底", "湘西"],
  广东: ["广州", "深圳", "珠海", "汕头", "韶关", "佛山", "江门", "湛江", "茂名", "肇庆", "惠州", "梅州", "汕尾", "河源", "阳江", "清远", "东莞", "中山", "潮州", "揭阳", "云浮"],
  海南: ["海口", "三亚"],
  四川: ["成都", "自贡", "攀枝花", "泸州", "德阳", "绵阳", "广元", "遂宁", "内江", "乐山", "南充", "眉山", "宜宾", "广安", "达州", "雅安", "巴中", "资阳", "阿坝", "甘孜", "凉山"],
  贵州: ["贵阳", "六盘水", "遵义", "安顺", "铜仁", "毕节", "黔西南", "黔东南", "黔南"],
  云南: ["昆明", "曲靖", "玉溪", "保山", "昭通", "丽江", "普洱", "临沧", "德宏", "怒江", "迪庆", "大理", "楚雄", "红河", "文山", "西双版纳"],
  陕西: ["西安", "铜川", "宝鸡", "咸阳", "渭南", "延安", "汉中", "榆林", "安康", "商洛"],
  甘肃: ["兰州", "嘉峪关", "金昌", "白银", "天水", "武威", "酒泉", "张掖", "庆阳", "平凉", "定西", "陇南", "临夏", "甘南"],
  青海: ["西宁", "海东", "海北", "海南", "黄南", "果洛", "玉树", "海西"],
  内蒙古: ["呼和浩特", "包头", "乌海", "赤峰", "通辽", "鄂尔多斯", "呼伦贝尔", "巴彦淖尔", "乌兰察布", "锡林郭勒盟", "兴安盟", "阿拉善盟"],
  广西: ["南宁", "柳州", "桂林", "梧州", "北海", "防城港", "钦州", "贵港", "玉林", "百色", "贺州", "河池", "来宾", "崇左"],
  西藏: ["拉萨", "那曲", "昌都", "林芝", "山南", "日喀则", "阿里"],
  宁夏: ["银川", "石嘴山", "吴忠", "固原", "中卫"],
  新疆维吾尔自治区: ["乌鲁木齐", "克拉玛依", "吐鲁番", "哈密", "和田", "阿克苏", "喀什", "克孜勒苏", "巴音郭楞", "昌吉", "博尔塔拉", "伊犁", "塔城", "阿勒泰"],
  香港: ["香港岛", "九龙东", "九龙西", "新界东", "新界西"],
  澳门: ["澳门半岛", "离岛"],
  台湾: ["台北", "高雄", "基隆", "新竹", "台中", "嘉义", "台南市"]
}


const MAJOR = [
  {
    main: "经营管理类",
    sub: [
      "总裁/总经理/CEO",
      "行政总监",
      "技术总监CTO/总工",
      "人力资源总监",
      "财务总监CFO/总会计师",
      "首席信息官CIO",
      "首席运营官/COO",
      "市场/营销总监",
      "联盟经理"
    ]
  },
  {
    main: "公关/市场营销类",
    sub: [
      "公关经理",
      "公关专员",
      "市场经理/营销经理",
      "渠道经理",
      "产品/品牌经理",
      "市场助理/专员",
      "市场营销/推广/合作",
      "客户代表/营销代表",
      "市场策划",
      "市场分析/调研",
      "CI设计与策划",
      "广告文案/媒体策划/设计"
    ]
  },
  {
    main: "贸易/销售/业务类",
    sub: [
      "国内贸易",
      "国外贸易/涉外业务",
      "跟单员",
      "报关员",
      "销售经理/区域经理/商务经理",
      "销售工程师/销售代表",
      "销售助理/业务员",
      "商务代表/商务助理/业务助理"
    ]
  },
  {
    main: "财务类",
    sub: [
      "财务经理/主任",
      "会计主管",
      "注册会计师",
      "会计",
      "出纳",
      "审计经理/主管/专员",
      "注册审计师",
      "统计",
      "计划",
      "稽核",
      "财务分析",
      "成本分析/核算"
    ]
  },
  {
    main: "行政/人力资源管理类",
    sub: [
      "行政经理/主管",
      "行政专员/行政秘书/助理",
      "办公室主任",
      "人力资源经理/专员/助理",
      "培训经理/专员/助理",
      "招聘经理/专员/助理",
      "薪酬福利经理/专员/助理",
      "绩效考核经理/专员/助理"
    ]
  },
  {
    main: "文职类",
    sub: [
      "图书情报/资料/文档管理",
      "文秘/高级文员",
      "资料/文档撰写/编辑",
      "计算机操作员/打字员/文员/校对",
      "前台/接待员/礼仪",
      "收发员/话务员/后勤",
      "英语翻译",
      "日语翻译",
      "法语翻译",
      "德语翻译",
      "韩语翻译",
      "其它语种"
    ]
  },
  {
    main: "客户服务类",
    sub: [
      "客户服务经理",
      "技术支持/客户培训",
      "售前/售后服务",
      "热线咨询",
      "客户关系处理",
      "客户分析",
      "投诉处理"
    ]
  },
  {
    main: "工厂类",
    sub: [
      "厂长/副厂长",
      "厂务管理",
      "车间主任/拉长",
      "产品开发",
      "品质管理",
      "采购管理",
      "仓储管理",
      "物料管理",
      "设备管理",
      "安全管理",
      "配色美工",
      "计划/调度/协调员",
      "PMC/SMT技术员",
      "生产控制文员"
    ]
  },
  {
    main: "计算机/互联网类",
    sub: [
      "技术主管/项目经理",
      "信息经理/内容主管/栏目主持",
      "程序员/软件工程师",
      "系统集成/支持",
      "系统分析员",
      "硬件开发工程师/硬件工程师",
      "软件测试工程师",
      "硬件测试工程师",
      "网站/电子商务开发",
      "网络工程师",
      "网站策划",
      "网页设计与制作",
      "网站美工/电脑美工",
      "网站编辑",
      "数据库开发与管理",
      "系统/网络管理及维护",
      "系统/网络/信息安全",
      "多媒体设计与开发",
      "计算机辅助设计与绘图"
    ]
  },
  {
    main: "电子/通讯类",
    sub: [
      "技术主管/项目经理",
      "电子工程师",
      "无线电工程师",
      "电子元器件工程师",
      "电路设计/电子测试/半导体技术",
      "单片机/DSL/DSP/底层软件开发",
      "广播视听设备工程师",
      "电子/电器维修工程师",
      "电子测试工程师",
      "电子技术员",
      "工艺工程师",
      "仪器/仪表/测量工程师",
      "绘图工程师",
      "通讯/通信工程师"
    ]
  },
  {
    main: "机械类",
    sub: [
      "机械工程师/模具设计",
      "机械制图工程师",
      "机械制造工程师",
      "机电工程师",
      "结构工程师",
      "注塑/电镀工程师",
      "机电技术员"
    ]
  },
  {
    main: "规划/建筑/建材类",
    sub: [
      "城镇规划设计",
      "风景园林规划设计",
      "园艺工程师",
      "建筑设计",
      "土木建筑/工民建",
      "绘图/建筑制图",
      "结构工程师",
      "测绘工程师",
      "施工管理",
      "工程监理",
      "工程预决算",
      "装饰/安装工程师",
      "道桥设计与施工",
      "港口与航道设计与施工",
      "水电/管道工程师",
      "给排水工程师",
      "制冷暖通工程师",
      "智能楼宇设计与施工",
      "岩土工程师/地下工程",
      "安全注册主任",
      "安全员",
      "建材"
    ]
  },
  {
    main: "房地产/物业管理类",
    sub: [
      "房地产开发/策划",
      "房地产经纪",
      "房地产评估/交易",
      "房地产销售",
      "物业管理经理/主管/主任",
      "物业管理员/助理"
    ]
  },
  {
    main: "金融/经济",
    sub: [
      "银行会计",
      "储蓄员",
      "信贷/信贷风险控制",
      "银行国际业务",
      "投资银行",
      "外汇",
      "建筑审计",
      "证券经纪人",
      "证券投资顾问",
      "操盘手/交易员",
      "行业分析",
      "股评",
      "期货/股票经纪",
      "投资管理/顾问",
      "资产评估",
      "融资",
      "保险经纪人/保险业务员",
      "拍卖师"
    ]
  },
  {
    main: "设计类",
    sub: [
      "平面设计",
      "动画设计",
      "产品外观设计",
      "装璜美术设计/室内外设计",
      "服装设计",
      "广告设计",
      "珠宝设计",
      "展览设计",
      "家具设计",
      "工艺品设计",
      "形象设计"
    ]
  },
  {
    main: "法律类",
    sub: [
      "律师",
      "法律顾问",
      "法律助理"
    ]
  },
  {
    main: "酒店/餐饮类",
    sub: [
      "酒店经理/餐馆经理",
      "大堂副理/楼面经理",
      "领班",
      "厨师",
      "服务员",
      "咨客"
    ]
  },
  {
    main: "物流/交通运输类",
    sub: [
      "物流经理/主管",
      "货运仓储经理/主管",
      "船务",
      "运输管理/调度"
    ]
  },
  {
    main: "商场类",
    sub: [
      "商场经理/主管",
      "业务经理/主任",
      "店面设计/陈列",
      "店长",
      "营业员/导购员/店员",
      "收银员",
      "促销员",
      "物价员"
    ]
  },
  {
    main: "电气/电力类",
    sub: [
      "电力拖动与自动控制",
      "电机与电器",
      "电力工程师/电气",
      "电路布线设计",
      "智能大厦/综合布线/弱电",
      "灯饰研发工程师",
      "光源/照明",
      "变压器/磁电工程师",
      "家用电器研发",
      "家用电器维修"
    ]
  },
  {
    main: "咨询/顾问类",
    sub: [
      "企业管理咨询",
      "企业管理顾问",
      "信息咨询/中介",
      "培训师"
    ]
  },
  {
    main: "化工/生物类",
    sub: [
      "化工生产工程师",
      "精细化工工程师",
      "高分子材料工程师",
      "化工制药",
      "化验员/检验员",
      "化工生产技术员",
      "生物工程"
    ]
  },
  {
    main: "文化/教育/体育类/艺术类",
    sub: [
      "图书情报/资料/文档管理",
      "高等教育",
      "中等教育",
      "小学教育/幼儿教育/保育员",
      "职业教育/培训/家教",
      "体育教练/健美教练",
      "模特",
      "舞蹈",
      "声乐",
      "器乐"
    ]
  },
  {
    main: "医疗卫生/护理/保健类",
    sub: [
      "西医",
      "中医",
      "心理医生",
      "兽医/宠物医生",
      "医疗技术/医学检验师",
      "药剂师",
      "麻醉师",
      "护理人员/护士",
      "卫生防疫",
      "妇幼保健",
      "针灸推拿"
    ]
  },
  {
    main: "新闻/出版/传媒类",
    sub: [
      "总编/主编",
      "文字编辑",
      "美术编辑/美工",
      "记者/新闻采编",
      "摄影录制",
      "节目主持/DJ/播音",
      "演员",
      "影视策划/制作",
      "音效师"
    ]
  },
  {
    main: "公众服务类",
    sub: [
      "保安/消防员",
      "快递员",
      "旅游/导游",
      "声讯",
      "按摩师/美容/美发",
      "家政",
      "裁缝",
      "环卫工"
    ]
  },
  {
    main: "印刷/染织类",
    sub: [
      "印刷主管",
      "印刷技工",
      "版房制版师傅",
      "晒版师",
      "染织类"
    ]
  },
  {
    main: "技工类",
    sub: [
      "机器冷加工/车、铣、刨、磨、镗、锯等",
      "机器热加工/铸、锻、冲压、焊、金属热处理、注塑等",
      "装配工",
      "叉车工",
      "汽车修理工",
      "司机",
      "水/木/漆工",
      "电工",
      "空调工/电梯工/锅炉工"
    ]
  },
  {
    main: "其他专业类",
    sub: [
      "食品类",
      "造纸类",
      "家具制造类",
      "农林牧渔/水利类",
      "地质/矿产类",
      "环境保护/监测/治理类"
    ]
  }
]

export { MAJOR, CITY }